---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionErrorCode
source: html/b4a75bd1-f24d-ea40-2781-f8510ebec5e6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionErrorCode

Error codes for StructuralSection related operations.

## Syntax (C#)
```csharp
public enum StructuralSectionErrorCode
```